'use strict';
app.run(function(storage){

  var queuePojData = {
    "EMQ项目": {
      "代码检查与单元测试":{
        "_dl": "2016/7/6",
        "micloud-emq-common":{
          "_dl": "2016/7/5 12:00",
          "cache层测试完毕": {"_dl": "2016/7/5 00:00", "_f": 0.3},
          "service层测试完毕": {"_dl": "2016/7/5 10:00"}
        },
        "micloud-emq-service":{
          "_dl": "2016/7/5 16:00"
        },
        "micloud-emq-message":{
          "_dl": "2016/7/5 22:00"
        }
      },
      "集成功能检查与测试":{"_dl": "2016/7/8"},
      "集成性能测试":{"_dl": "2016/7/11"},
      "接入与验证":{
        "_dl": "2016/7/15",
        "Staging平台搭建":{"_dl": "2016/7/12 18:00"},
        "相册服务接入编码":{"_dl": "2016/7/13 12:00"},
        "相册服务接入测试":{"_dl": "2016/7/14 18:00"}
      }
    }
  }

  storage.register("EMQ项目", queuePojData, true, "2016/7/1", "2016/7/16");
});
