'use strict';
app.run(function(storage){

  var techBookData = {
    "技术书籍":{
      "思想类": {},
      "开源项目类": {
        "Netty权威指南": {},
        "深入理解Nginx: 模块开发与应用架构解析": {}
      },
      "基础技术类": {
        "协议": {},
        "算法": {
          "算法技术手册": {},
          "算法精解": {}
        },
        "基础组件": {
          "MySQL技术内幕: SQL编程": {},
          "MySQL性能调优与架构设计": {}
        },
        "代码": {
          "快学Scala": {},
          "JavaScript高级程序设计":{},
          "Java程序性能优化": {},
          "Clean Code": {},
          "Java程序员修炼之道": {},
          "Java技术手册": {}
        },
        "架构": {
          "计算机程序设计艺术": {},
          "Web性能权威指南": {},
          "24小时365天不间断服务": {},
          "大型网站架构:核心原理与案例分析": {},
          "程序员必读之软件架构":{},
          "高性能Linux服务器构建实战:运维监控、性能调优与集群应用": {}
        },
        "系统与工具": {
          "Linux命令行与Shell编程大全": {},
          "Linux Shell脚本攻略": {},
          "Pro Git": {_f: true},
          "Maven实战": {}
        },
        "其它": {
          "编译原理": {},
          "OSGI实战": {}
        },
        "大数据与机器学习": {
          "机器学习": {}
        },
        "安全": {
          "云计算安全指南": {}
        }
      },
      "实践应用类": {
        "SEO实战密码": {},
        "贴心设计:打造高可用的移动产品": {},
        "移动App测试实战:顶级互联网企业软件测试和质量提升最佳实践": {},
        "众妙之门:抓住访客心理的网页设计": {}
      },
      "移动开发": {
        "使用HTML,CSS和JavaScript开发Android应用": {}
      },
      "待阅读问题": {
        "Spray的Directive系统": {},
        "Vernish设计思想博客": {},
        "Kafka源代码": {},
        "为什么Set的Iterator可能是线程不安全的": {}
      }
    }
  };

  storage.register("技术书籍", techBookData, true, "2016/7/1", "2016/12/30", storage.LEVEL_POJ);
});
