'use strict';
app.run(function(storage){

  var viewBookData = {
    "视野书籍":{
      "商业": {
        "参与感": {_ac: true},
        "微信: 这么玩才赚钱": {},
        "销售与市场": {},
        "解密无印良品": {},
        "好战略坏战略": {},
        "雷军:让创业回归简单": {},
        "创业维艰": {},
        "激活消费者心理需求": {_ac: true},
        "聪敏人是如何思考的": {_ac: true}
      },
      "心理社会": {
        "乌合之众": {_ac: true},
        "心学大师王阳明": {},
        "认同感: 用故事包装事实的艺术": {}
      },
      "金融": {
        "交易员量价实战技法": {},
        "百战成精": {},
        "国富论": {},
        "金钱有术": {},
        "月亮和六便士": {},
        "千炼成妖": {},
        "量化交易: 如何构建自己的算法交易": {},
        "经济学通识-路兆丰": {},
        "期货市场技术分析": {}
      },
      "思维": {
        "思考的艺术": {},
        "系统化思维导论": {},
        "逻辑学": {},
        "思维导图的三招十八式": {}
      },
      "其它": {
        "Word排版艺术": {},
        "观呼吸": {}
      },
      "待阅读问题": {
        "无": {}
      }
    }
  };

  storage.register("视野书籍", viewBookData, true, "2016/7/1", "2016/12/30", storage.LEVEL_POJ);
});
